{
  "battle": "Морской",
  "ship": "Бой",

  "home": "Главная",
  "game": "Игра",
  "single": "Один игрок",
  "rules": "Правила",
  "login": "Войти",
  "logout": "Выйти",

  "settings": "Настройки",

  "language": "Язык",
  "english": "English",
  "russian": "Русский",

  "theme": "Световой режим",
  "light": "Светлый",
  "dark": "Тёмный",

  "scheme": "Цветовая схема",
  "green": "Зелёная",
  "blue": "Голубая",

  "sound": "Звук",
  "on": "Включён",
  "off": "Выключен",

  "battleship": "Морской бой",
  "createdBy": "Создано",
  "powerRangers": "Могучими Рейнджерами",

  "welcomeTitle": "Добро пожаловать на морской бой!",
  "welcomeFirst": "Это стратегическая игра-угадайка для двух участников. В неё играют на размеченных картах, на каждой из которых отмечены корабли игроков.",
  "playBattleShip": "Начать морской бой",
  "welcomeSecond": "Расположение флота скрыто от другого игрока. Участники по очереди делают «выстрелы» по кораблям, и цель игры состоит в том, чтобы уничтожить военный флот противника.",
  "rulesOfTheGame": "Правила игры",

  "profile": "Игровой профиль",
  "loginPlease": "Пожалуйста, войдите в свой аккаунт.",

  "authorization": "Авторизация",
  "enterName": "Введите ник",

  "description": "Описание",
  "descriptionFirst": "Игра ведётся на двух квадратных размеченных картах, которые обычно имеют размер 10×10, а отдельные квадраты в сетке обозначаются буквами и цифрами. На своей карте игрок расставляет корабли, на другой показываются выстрелы соперника.",
  "arrange": "Расстановка кораблей",
  "arrangeFirst": "Перед началом игры каждый игрок тайно расставляет свои корабли на основной сетке. Каждый корабль занимает ряд последовательных квадратов, расположенных горизонтально или вертикально. Количество квадратов для каждого корабля определяется типом корабля. Корабли не могут перекрываться (только один корабль может занимать любую заданную клетку на карте).",
  "arrangeSecond": "Разрешённые типы и количество кораблей одинаковы для каждого игрока. Они могут варьироваться в зависимости от правил. Корабли должны быть скрыты от игроков и не должны видеть фигуры друг друга. Игроки должны обнаруживать позиции кораблей своих противников",
  "shipAttack": "Атака кораблей",
  "shipAttackFirst": "После того, как корабли расставлены, игра продолжается в несколько раундов. Если выстрел пришёлся в клетку, не занятую ни одним кораблём противника, то следует ответ «Мимо!» и право хода переходит к сопернику.",
  "shipAttackSecond": "Если выстрел пришёлся в клетку, где находится многопалубный корабль, то следует ответ «Ранил(а)!». Cтрелявший игрок получает право на ещё один выстрел.",

  "battleWinner": "Определение победителя",
  "battleWinnerFirst": "Когда все клетки корабля поражены, владелец корабля объявляет о затоплении авианосца, подводной лодки, крейсера/эсминца/патрульного катера или титульного линкора. Если все корабли игрока потоплены, игра окончена, и его противник побеждает.",

  "waiting": "Ожидаем соперника...",
  "random": "Случайно",
  "reset": "Сбросить",
  "dragAndDrop": "Перетащите свои корабли на поле или нажмите кнопку для случайного расположения.",
  "ready": "Готово",
  "start": "Начать игру"
}
