{
  "battle": "Battle",
  "ship": "Ship",

  "home": "Home",
  "game": "Game",
  "vsFriend": "Vs Player",
  "vsComputer": "Vs Computer",
  "vsRandom": "Vs Random",
  "friendGame": "Game with friend",
  "single": "Single Player",
  "rules": "Rules",
  "create": "Create",
  "connect": "Connect",
  "login": "Login",
  "logout": "Logout",

  "settings": "Settings",

  "language": "Language",
  "english": "English",
  "russian": "Русский",

  "theme": "Theme mode",
  "light": "Light",
  "dark": "Dark",

  "scheme": "Color scheme",
  "green": "Green",
  "blue": "Blue",

  "sound": "Sound",
  "on": "On",
  "off": "Off",

  "chat": "Chat for players",
  "generalChat": "General Chat",
  "gameChat": "Game Chat",
  "you": "You:",
  "send": "Send a message",
  "admiral": "Admiral:",
  "welcomeMessage": "Hello! Have a nice chat :)",


  "battleship": "BattleShip Online",
  "createdBy": "Created by",
  "powerRangers": "Power Rangers",

  "welcomeTitle": "Welcome to the ButtleShip Online!",
  "welcomeFirst": "This is a strategy type guessing game for two players. It is played on ruled grids on which each player's fleet of warships are marked.",
  "playBattleShip": "Play BattleShip",
  "welcomeSecond": "The locations of the fleets are concealed from the other player. Players alternate turns calling \"shots\" at the other player's ships, and the objective of the game is to destroy the opposing player's fleet.",
  "rulesOfTheGame": "Rules of the game",

  "profile": "Gaming profile",
  "loginPlease": "Please login to your account.",

  "authorization": "Authorization",
  "enterName": "Enter name",

  "description": "Description",
  "descriptionFirst": "The game is played on two grids, two for each player. The grids are typically square 10×10 and the individual squares in the grid are identified by letter and number. On one grid the player arranges ships and records the shots by the opponent. On the other grid, the player records their own shots.",
  "arrange": "Arrange the ships",
  "arrangeFirst": "Before play begins, each player secretly arranges their ships on their primary grid. Each ship occupies a number of consecutive squares on the grid, arranged either horizontally or vertically. The number of squares for each ship is determined by the type of ship. The ships cannot overlap (only one ship can occupy any given square in the grid).",
  "arrangeSecond": "The types and numbers of ships allowed are the same for each player. These may vary depending on the rules. The ships should be hidden from players sight and it's not allowed to see each other's pieces. The game is a discovery game which players need to discover their opponents ship positions.",
  "shipAttack": "Ship attack",
  "shipAttackFirst": "After the ships have been positioned, the game proceeds in a series of rounds. In each round, each player takes a turn to announce a target square in the opponent's grid which is to be shot at. The opponent announces whether or not the square is occupied by a ship.",
  "shipAttackSecond": "The attacking player marks the hit or miss on their own tracking or target grid with a pencil marking in the paper version of the game, or the appropriate color peg in the pegboard version (red for hit, white for miss), in order to build up a picture of the opponent's fleet.",

  "battleWinner": "Battle Winner",
  "battleWinnerFirst": "When all of the squares of a ship have been hit, the ship's owner announces the sinking of the Carrier, Submarine, Cruiser/Destroyer/Patrol Boat, or the titular Battleship. If all of a player's ships have been sunk, the game is over and their opponent wins.",

  "waiting": "Waiting for an opponent...",
  "random": "Random",
  "reset": "Reset",
  "dragAndDrop": "Drag and drop your ships on the field or press the button for a random arrangement.",
  "ready": "Ready",
  "start": "Start Game",

  "winReconnect": "Opponent has returned",
  "winDisconnect": "Opponent has left the battle, you can wait, he may to return",
  "winExit": "The enemy has left the battle",
  "winWin": "You have sunk all enemy ships",
  "winLose": "Enemy has destroyed all your ships"
}
